const API_BASE_URL = 'https://localhost:3000/api';
const stationData = {
    "常磐線（取手・土浦方面）": [
        "取手", "藤代", "龍ヶ崎", "牛久", "ひたち野うしく", "荒川沖", "土浦", "神立", "高浜", "石岡", "羽鳥", "友部", "内原", "赤塚"
    ],
    "常磐線（勝田・日立方面）": [
        "勝田", "佐和", "東海", "大甕", "常陸多賀", "日立", "小木津", "十王", "高萩", "南中郷", "磯原", "大津港"
    ],
    "水郡線（常陸大宮・大子方面）": [
        "常陸青柳", "常陸津田", "後台", "下菅谷", "中菅谷", "上菅谷", "常陸鴻巣", "瓜連", "静", "常陸大宮", "玉川村", "野上原", "山方宿", "中舟生", "下小川", "西金", "上小川", "袋田", "常陸大子", "下野宮"
    ],
    "水郡線（常陸太田方面）": [
        "南酒出", "額田", "河合", "谷川原", "常陸太田"
    ]
};

document.addEventListener('DOMContentLoaded', async () => {
    const selectBox = document.getElementById('station-select');
});